/* ---------------------------------------------------------------------------- */
// New in 1.0

/* general use */
"OK" = "OK";
"Yes" = "是";
"No" = "否";
"Don't show again" = "不再显示";

/* misk */
"Set as default compressor" = "设为默认压缩软件";
"Not now" = "稍后再说";
"Want to make Keka your default compressor?" = "要Keka作为默认压缩软件?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "这意味着所有兼容的文件将用Keka提取. 你可以稍后在偏好面板设置.";
"Really want to close Keka?" = "是否要关闭Keka?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "当前的操作将被取消. 当任务完成后可选择等待和退出Keka.";

/* ---------------------------------------------------------------------------- */



/* Growl */

/* ---------------------------------------------------------------------------- */
// New in 1.0
"Password needed" = "需要密码";
"File \"%@\" needs a password to be extracted" = "文件 \"%@\" 需要密码来提取";
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Extraction of \"%@\" done" = "提取 \"%@\" 完成";
"Extraction of \"%@\" failed." = "提取 \"%@\" 失败.";
//"Extraction of file \"%@\" complete" = "提取文件 \"%@\" 完成";
//"Extraction of file \"%@\" failed." = "提取文件 \"%@\" 失败.";
/* ---------------------------------------------------------------------------- */
"Extraction complete" = "提取完成";
"Extraction fail" = "提取失败";
"Compression complete" = "压缩完成";
"File \"%@\" created" = "文件 \"%@\" 已创建";
"Compression fail" = "压缩失败";
"File \"%@\" cannot be created" = "File \"%@\" 无法创建";
"Operation not implemented" = "操作未执行";
"This operation is not implemented yet so Keka is in beta process." = "此操作尚未实现，keka是在测试过程.";



/* Progress window */
"Performing operation..." = "执行操作中...";
"Waiting..." = "等待中...";
"Extracting \"%@\"" = "提取 \"%@\"";
"Extracting \"%@...\"" = "提取 \"%@...\"";
"Creating %@ file..." = "正在创建 %@ 文件...";
"Creating file \"%@\"" = "创建文件 \"%@\"";
"Creating file \"%@...\"" = "正在创建文件 \"%@...\"";
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Time elapsed: %d:%@%d:%@%d hours%@" = "已用时间: %d:%@%d:%@%d 小时%@";
"Time elapsed: %d:%@%d minutes%@" = "已用时间: %d:%@%d 分%@";
"Time elapsed: %d seconds%@" = "已用时间: %d 秒%@";


//"Time elapsed: %d seconds" = "已用时间: %d 秒";
//"Time elapsed: %d:%@%d minutes" = "已用时间: %d:%@%d 分";
//"Time elapsed: %d:%@%d:%@%d hours" = "已用时间: %d:%@%d:%@%d 小时";
/* ---------------------------------------------------------------------------- */
"%d seconds" = "%d 秒";
"%d:%@%d minutes" = "%d:%@%d 分";
"%d:%@%d:%@%d hours" = "%d:%@%d:%@%d 小时";
"Pause" = "暂停";
"Continue" = "完成";
"Operation paused" = "暂停操作";
"Cancel" = "取消";
"Close" = "关闭";
"Operation failed" = "操作失败";
"Operation failed with error code %d" = "操作失败，错误代码 %d";
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Choose a name and folder to start the compression" = "选择一个名称和文件夹启动压缩";
"Creation of \"%@\" failed" = "创建的 \"%@\" 失败";
"Creating \"%@\"" = "创建中 \"%@\"";
"Prepearing extraction..." = "准备提取…";
"Choose a folder to extract this file" = "选择一个文件夹并提取此文件";
"Extraction of \"%@\" failed" = "提取 \"%@\" 失败";
"Keka - %i on queue" = "Keka - %i 排队";
"Keka can't create this ISO image" = "Keka 无法创建此ISO映像";
"You can only create an ISO image with a single folder. Try to put all your files in a folder and drop it to Keka to create the ISO image." = "你可以只用一个文件夹创建ISO映像。试着把你所有的文件夹中的文件拖放到Keka创建ISO映像.";
"Compress \"%@\" in %@ to..." = "压缩 \"%@\" 到 %@ to...";
"Compress in %@ to..." = "压缩 %@ 到...";
"Save as:" = "存储为:";
"Compress" = "压缩";
"Extract \"%@\" to..." = "提取 \"%@\" 到…";
"Extract as:" = "提取为:";
"Extract" = "提取";
" - Remaining: Calculating..." = " - 还有: 计算中...";
" - Remaining: About one second" = " - 还有: 大约1秒";
" - Remaining: About %d seconds" = " - 还有: 大约 %d 秒";
" - Remaining: About 1 minute" = " - 还有: 大约 1 分钟";
" - Remaining: About %d minutes" = " - 还有: 大约 %d 分钟";
" - Remaining: About 1 hour" = " - 还有: 大约 1 小时";
" - Remaining: About %d hours" = " - 还有: 大约 %d 小时";
" - Remaining: About 1 day" = " - 还有: 大约 1 天";
" - Remaining: About %d days" = " - 还有: 大约 %d 天";
" - Remaining: About 1 year" = " - 还有: 大约 1 年";
" - Remaining: About %d years" = " - 还有: 大约 %d 年";
" - Remaining: Less than one second" = " - 还有: 少于一秒";
"Can't show progress time..." = "无法显示时间进度…";
/* ---------------------------------------------------------------------------- */



/* Password window */
/* ---------------------------------------------------------------------------- */
// Updated in 1.0
"Password for \"%@\"" = "密码 \"%@\"";
/* ---------------------------------------------------------------------------- */



/* Preferences */
// Compression methods
/* ---------------------------------------------------------------------------- */
// Replaced in 1.0
"No compression" = "不压缩";
"Fastest, less compression" = "最快速, 不压缩";
"Fast, less compression" = "快速, 不压缩";
"Normal" = "标准";
"Slow, more compression" = "慢速, 更多压缩";
"Slowest, more compression" = "最慢速, 更多的压缩";

"Method: No compression" = "方法: 不压缩";
"Method: Fastest, less compression" = "方法: 最快速, 不压缩";
"Method: Fast, less compression" = "方法: 快速, 不压缩";
"Method: Normal" = "方法: 标准";
"Method: Slow, more compression" = "方法: 慢速, 更多压缩";
"Method: Slowest, more compression" = "方法: 最慢速, 更多的压缩";
// New in 1.0
"Compression" = "压缩";
"Extraction" = "提取";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka 不能使用 \"extlx.plist\" 列表, 请与开发商取得联系.\n\n现在Keka即将退出.";
"Keka is dying!" = "Keka崩溃中!";
/* ---------------------------------------------------------------------------- */

// Save location and defaul name combo boxes
"Ask each time" = "每次询问";
"Next to original file" = "原始文件旁";
"Custom folder..." = "自定义文件夹...";
"Same as original file" = "同原文件";
"Custom name..." = "自定义名称...";
"Compressed file" = "压缩文件";
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Set as default folder" = "设置为默认文件夹";
/* ---------------------------------------------------------------------------- */

// Action to perform - ### VERY IMPORTANT TO BE THE SAME AS IN THE XIB FILE ###
"Perform automatic action" = "自动执行动作";
"Always compress" = "总是压缩";
"Always extract" = "总是提取";

//Split items - ### VERY IMPORTANT TO BE THE SAME AS IN THE XIB FILE ###
"1.4 MB Floppy" = "1.4 MB 软驱";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4480 MB DVD" = "4480 MB DVD";



/* Drag and Drop layer */
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Drop here to extract" = "丢到这里提取";
"Drop here to compress" = "丢到这里解压";
/* ---------------------------------------------------------------------------- */



/* Error messages */
/* ---------------------------------------------------------------------------- */
// New in 1.0
"Error code %d\nThe first part \"%@\" can't be found" = "错误代码 %d\n第一部分 \"%@\" 无法找到";
"unknown" = "未知";
"Unknown error" = "未知错误";
"Error code %d using \"%@\"\n%@" = "错误代码 %d 使用中 \"%@\"\n%@";
"No errors found" = "No errors found";
"Minor error, the operation may be done well" = "小错误, 该操作也许会做的更好";
"Fatal error" = "Fatal error";
"CRC error occurred, maybe the file is corrupt" = "CRC错误，或者文件已损坏";
"Attempt to modify an archive previously locked" = "尝试修改锁定文件";
"Maybe you don't have permission to write or your disk is full" = "也许你没有写权限或磁盘已满";
"Can't open the file, maybe you don't have read permission" = "无法打开该文件，你可能没有读取权限";
"Command line error, please contact with the developer" = "命令行错误，请与开发商联系";
"Not enough memory. Try to close some programs and repeat the operation" = "内存不足。尝试关闭一些程序和重复操作";
"Can't create the file, maybe you don't have permission or free space" = "无法创建文件，你可能没有权限或空闲空间";
"Canceled manually" = "手动取消";
"Bad password, try again" = "密码错误，再试一次";
"This archive is locked" = "这个档案已被锁定";
"Write error. No permission? No space left?" = "读写错误.没有许可.没有空间?";
"Can't open the file, maybe it's not accessible" = "无法打开文件, 也许是不可访问的";
"No files matching the mask" = "没有匹配的掩码文件";
/* ---------------------------------------------------------------------------- */
